//1

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

//const number = prompt();

//if (Number(number) === 10) {
//// alert('Вірно');
//} else {
// alert('Невірно');
//}

//2

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

//const min = Math.floor(Math.random() * (59 - 0) + 0);

//if (min < 15) {//
//alert(min + ' входить в першу чверть');
//} else if (min >= 15 && min < 30) {
//alert(min + ' входить в першу чверть');
//} else if (min >= 30 && min < 45) {
//alert(min + ' входить в третю чверть');
//} else {
//alert(min + ' входить в четверту чверть');
//}

//3

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//const num = prompt();

//switch (num) {
//case '1':
//alert('Зима');
//break;
//case '2':
//alert('Весна');
//break;
//case '3':
//alert('Літо');
//break;
//case '4':
//alert('Осінь');
//break;
//default:
//alert('WTF');
//}

// 4

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

//const minutesEnter = prompt('Enter minutes:');

//const minutes = String(minutesEnter % 60).padStart(2, '0');
//const hours = String(Math.floor(minutesEnter / 60)).padStart(2, '0');
//console.log(`${hours}:${minutes}`);

//5

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

//const login = prompt('Login:');

//if (login === 'Admin') {
//const password = prompt('Password');
//if (password === 'Я головний') {
//alert('Добрий день!');
//} else {
//alert('Невірний пароль!!');
//}
//} else if (!login.trim()) {
//alert('Скасовано');
//} else {
//alert('Я вас не знаю');
//}

// 7

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

//function getNumbers(min, max) {
//let sumOfEvenNumbers = 0;

//for (let i = max; i >= min; i--) {
//console.log(i);
//if (i % 2 === 0) {
//sumOfEvenNumbers += i;
//}
//}
//return sumOfEvenNumbers;
//}
//const sum = getNumbers(5, 10);
